[
  {
    "id": 1,
    "common_name": "Sunflower",
    "scientific_name": "Helianthus annuus",
    "how_to_handle": "Handle with care. Gently transplant when seedlings are large enough to handle. Be careful not to damage the roots.",
    "light_needs": "Full sun, at least 6-8 hours of direct sunlight per day.",
    "watering": "Water regularly, keeping the soil moist but not soggy. Water deeply to encourage deep root growth.",
    "soil_type": "Well-drained, sandy loam with a pH level of 6.0 to 7.5.",
    "pot_change_time": "Change pots when the plant outgrows its current container, usually every 1-2 years.",
    "helpful": "Attracts pollinators, provides seeds for birds, and improves soil health.",
    "appearance": "Tall, bright yellow flowers with a dark center, large green leaves. Can grow up to 10 feet tall.",
    "temperature_range": "Prefers temperatures between 70-85°F (21-29°C).",
    "humidity_needs": "Moderate humidity; avoid high humidity as it can lead to fungal diseases.",
    "planting_season": "Best planted in late spring after the last frost.",
    "growth_rate": "Fast-growing, can reach maturity in 70-100 days.",
    "fertilizer": "Use a balanced fertilizer once a month during the growing season."
  },
  {
    "id": 2,
    "common_name": "Tomato",
    "scientific_name": "Solanum lycopersicum",
    "how_to_handle": "Transplant carefully after the last frost, handling the seedling by the leaves and not the stem.",
    "light_needs": "Full sun, at least 6-8 hours of sunlight per day.",
    "watering": "Water deeply but infrequently to keep the soil consistently moist. Avoid overhead watering to reduce disease risk.",
    "soil_type": "Well-drained, fertile soil rich in organic matter with a pH level of 6.0 to 6.8.",
    "pot_change_time": "Change pots when seedlings become root-bound or when they outgrow their containers, typically every 6-12 months.",
    "helpful": "Rich in vitamins A, C, and K; helps boost immunity.",
    "appearance": "Green leafy plant with round, red, or yellow fruits. Can grow up to 6 feet tall.",
    "temperature_range": "Optimal temperatures between 70-85°F (21-29°C).",
    "humidity_needs": "Moderate humidity, keep air circulating to avoid fungal growth.",
    "planting_season": "Plant after the last frost when soil temperatures exceed 60°F (15°C).",
    "growth_rate": "Medium to fast-growing, can mature in 50-90 days.",
    "fertilizer": "Use a balanced, high-potassium fertilizer every 2-3 weeks during the growing season."
  },
  {
    "id": 3,
    "common_name": "Lettuce",
    "scientific_name": "Lactuca sativa",
    "how_to_handle": "Handle seedlings with care, transplant when the leaves are large enough to handle, and avoid disturbing the roots.",
    "light_needs": "Partial to full sun, around 4-6 hours of sunlight daily.",
    "watering": "Water regularly to keep the soil evenly moist, but avoid waterlogging.",
    "soil_type": "Loose, well-drained soil with a slightly acidic to neutral pH (6.0 to 7.0).",
    "pot_change_time": "Change pots when plants show signs of overcrowding, typically every 3-6 months.",
    "helpful": "A great source of vitamins A and K, helps improve digestion.",
    "appearance": "Green, leafy plant with crisp, smooth leaves. Can be harvested at different stages.",
    "temperature_range": "Prefers cooler temperatures between 55-75°F (13-24°C).",
    "humidity_needs": "Moderate humidity, avoid excessive moisture to prevent mold.",
    "planting_season": "Best planted in early spring or fall.",
    "growth_rate": "Fast-growing, can be harvested in 30-60 days depending on variety.",
    "fertilizer": "Use a light, balanced fertilizer every 2-3 weeks for optimal growth."
  },
  {
    "id": 4,
    "common_name": "Cucumber",
    "scientific_name": "Cucumis sativus",
    "how_to_handle": "Handle seedlings gently, avoid disturbing the roots when transplanting. Space plants to allow for spreading vines.",
    "light_needs": "Full sun, at least 6 hours of sunlight daily.",
    "watering": "Water deeply and consistently, especially during dry periods. Keep soil moist but well-drained.",
    "soil_type": "Well-drained, loamy soil rich in organic matter with a pH level of 6.0 to 7.0.",
    "pot_change_time": "Change pots when plants become root-bound, typically every 6 months or as needed.",
    "helpful": "Helps with hydration due to its high water content, rich in vitamins K and C.",
    "appearance": "Vining plant with long, green fruits, can grow up to 10 feet or more.",
    "temperature_range": "Prefers warm temperatures between 70-95°F (21-35°C).",
    "humidity_needs": "Moderate humidity, avoid wet leaves to reduce fungal diseases.",
    "planting_season": "Plant after the last frost, when the soil temperature is above 60°F (15°C).",
    "growth_rate": "Fast-growing, ready for harvest in 50-70 days.",
    "fertilizer": "Use a balanced fertilizer once a month, especially during fruiting."
  },
  {
    "id": 5,
    "common_name": "Peppermint",
    "scientific_name": "Mentha × piperita",
    "how_to_handle": "Handle with care, as mint can be invasive. Keep in containers to prevent spreading.",
    "light_needs": "Partial shade to full sun, at least 4-6 hours of sunlight per day.",
    "watering": "Water regularly to keep soil moist but not soggy. Mint prefers slightly moist conditions.",
    "soil_type": "Well-drained, moist soil rich in organic matter, with a pH of 6.0 to 7.0.",
    "pot_change_time": "Mint grows rapidly and may require a pot change every year.",
    "helpful": "Used for digestive issues, headaches, and in herbal teas.",
    "appearance": "A spreading herb with small, serrated leaves and purple or pink flowers.",
    "temperature_range": "Best grown in temperatures between 60-70°F (15-21°C).",
    "humidity_needs": "Prefers moderate humidity, and may need higher humidity indoors.",
    "planting_season": "Best planted in spring after the last frost.",
    "growth_rate": "Rapid growth; ready for harvesting in about 3-4 months.",
    "fertilizer": "Mint benefits from occasional feeding with a balanced fertilizer during the growing season."
  },
  {
    "id": 6,
    "common_name": "Basil",
    "scientific_name": "Ocimum basilicum",
    "how_to_handle": "Handle gently when transplanting, pinch off flowers to encourage more leaf growth.",
    "light_needs": "Full sun, at least 6-8 hours of direct sunlight per day.",
    "watering": "Water regularly to keep the soil evenly moist, avoid over-watering.",
    "soil_type": "Well-drained, fertile soil with a slightly acidic to neutral pH (6.0 to 7.0).",
    "pot_change_time": "Change pots when plants become root-bound, typically every 6 months.",
    "helpful": "Rich in antioxidants, vitamins A, K, and C, and has antibacterial properties.",
    "appearance": "A bushy herb with bright green, fragrant leaves and small white flowers.",
    "temperature_range": "Prefers warm temperatures between 70-90°F (21-32°C).",
    "humidity_needs": "Moderate humidity, keep the air flowing to prevent fungal growth.",
    "planting_season": "Plant after the last frost in spring when temperatures are consistently warm.",
    "growth_rate": "Fast-growing, can be harvested in 2-3 months.",
    "fertilizer": "Use a balanced fertilizer every 2-3 weeks during the growing season."
  },
  {
    "id": 7,
    "common_name": "Carrot",
    "scientific_name": "Daucus carota",
    "how_to_handle": "Handle seedlings carefully, avoid disturbing roots when transplanting. Thin the plants to prevent overcrowding.",
    "light_needs": "Full sun, at least 6 hours of sunlight per day.",
    "watering": "Water regularly, keeping the soil moist but not soggy. Avoid over-watering.",
    "soil_type": "Loose, well-drained, sandy loam with a pH level of 6.0 to 6.8.",
    "pot_change_time": "Not typically necessary unless the container is too small for root growth.",
    "helpful": "Rich in beta-carotene, good for eye health.",
    "appearance": "Underground root vegetable, with green leafy tops above ground.",
    "temperature_range": "Prefers cooler temperatures between 55-75°F (13-24°C).",
    "humidity_needs": "Moderate humidity, avoid wetting the leaves to reduce fungal risk.",
    "planting_season": "Plant early in spring, once the soil has warmed up and after the last frost.",
    "growth_rate": "Slow to medium growth, ready to harvest in 2-3 months depending on variety.",
    "fertilizer": "Use a low-nitrogen fertilizer to encourage root development."
  },
  {
    "id": 8,
    "common_name": "Rosemary",
    "scientific_name": "Salvia rosmarinus",
    "how_to_handle": "Handle carefully when transplanting. It prefers dry soil and needs good air circulation.",
    "light_needs": "Full sun, at least 6-8 hours of sunlight per day.",
    "watering": "Water sparingly, allowing the soil to dry out between watering. Avoid over-watering as it can cause root rot.",
    "soil_type": "Well-drained, sandy or loamy soil with a slightly acidic to neutral pH (6.0 to 7.0).",
    "pot_change_time": "Change pots when the plant outgrows its current container, every 1-2 years.",
    "helpful": "Used for its aromatic leaves in cooking and for medicinal purposes like improving digestion.",
    "appearance": "A woody herb with needle-like leaves and small blue flowers.",
    "temperature_range": "Prefers warmer temperatures between 65-80°F (18-27°C).",
    "humidity_needs": "Low humidity; thrives in drier conditions.",
    "planting_season": "Best planted in spring, after the last frost.",
    "growth_rate": "Slow-growing but can be harvested year-round.",
    "fertilizer": "Use a balanced fertilizer every 6-8 weeks during the growing season."
  },
  {
    "id": 9,
    "common_name": "Zinnia",
    "scientific_name": "Zinnia elegans",
    "how_to_handle": "Handle gently when transplanting. Zinnias can be direct-seeded in the garden or started indoors.",
    "light_needs": "Full sun, at least 6 hours of direct sunlight per day.",
    "watering": "Water regularly but allow the soil to dry between waterings. Avoid getting water on the foliage.",
    "soil_type": "Well-drained, fertile soil with a slightly acidic to neutral pH (6.0 to 7.5).",
    "pot_change_time": "Change pots when plants become root-bound, typically every 6 months.",
    "helpful": "Attracts pollinators like butterflies and bees, adds vibrant color to gardens.",
    "appearance": "Colorful flowers ranging from red, orange, pink, yellow to white, with lance-shaped green leaves.",
    "temperature_range": "Thrives in warm temperatures between 70-85°F (21-29°C).",
    "humidity_needs": "Low to moderate humidity, avoid excessive moisture on the leaves.",
    "planting_season": "Plant after the last frost in spring when temperatures are warm.",
    "growth_rate": "Fast-growing, blooms in 60-90 days depending on variety.",
    "fertilizer": "Use a balanced fertilizer every 4-6 weeks during the growing season."
  },
  {
    "id": 10,
    "common_name": "Lavender",
    "scientific_name": "Lavandula angustifolia",
    "how_to_handle": "Handle with care, as lavender can be sensitive to excessive moisture. Prune dead stems regularly.",
    "light_needs": "Full sun, at least 6-8 hours of direct sunlight per day.",
    "watering": "Water sparingly, allowing the soil to dry out between waterings.",
    "soil_type": "Well-drained, sandy or loamy soil with a pH level of 6.5 to 7.5.",
    "pot_change_time": "Change pots when the plant becomes root-bound, typically every 2 years.",
    "helpful": "Used in aromatherapy, cooking, and has anti-inflammatory properties.",
    "appearance": "A woody herb with purple spikes of flowers and silver-green leaves.",
    "temperature_range": "Prefers temperatures between 65-75°F (18-24°C).",
    "humidity_needs": "Low humidity; prefers dry, Mediterranean-type conditions.",
    "planting_season": "Plant in spring after the last frost or in early fall.",
    "growth_rate": "Slow-growing but can live for many years once established.",
    "fertilizer": "Use a light, balanced fertilizer once or twice during the growing season."
  },
  {
    "id": 11,
    "common_name": "Chili Pepper",
    "scientific_name": "Capsicum annuum",
    "how_to_handle": "Handle seedlings carefully, avoid damaging the roots. Transplant when the seedlings are large enough.",
    "light_needs": "Full sun, at least 6-8 hours of sunlight daily.",
    "watering": "Water regularly, keeping the soil moist but not soggy. Ensure good drainage.",
    "soil_type": "Well-drained, slightly acidic soil with a pH of 6.0 to 6.8.",
    "pot_change_time": "Change pots when seedlings become root-bound, usually every 6-12 months.",
    "helpful": "Rich in vitamin C and capsaicin, used for culinary and medicinal purposes.",
    "appearance": "Small to medium-sized plant with green leaves, producing colorful fruits ranging from green to red.",
    "temperature_range": "Prefers warm temperatures between 70-85°F (21-29°C).",
    "humidity_needs": "Moderate humidity, avoid excessive moisture on the leaves.",
    "planting_season": "Best planted in spring after the last frost.",
    "growth_rate": "Medium growth rate, ready for harvest in 60-90 days depending on variety.",
    "fertilizer": "Use a balanced fertilizer once a month during the growing season."
  },
  {
    "id": 12,
    "common_name": "Spinach",
    "scientific_name": "Spinacia oleracea",
    "how_to_handle": "Handle gently when transplanting, as spinach has shallow roots. Thin the plants to avoid overcrowding.",
    "light_needs": "Full sun to partial shade, at least 4-6 hours of sunlight per day.",
    "watering": "Water consistently, keeping the soil moist but not waterlogged.",
    "soil_type": "Loose, well-drained soil rich in organic matter with a pH of 6.5 to 7.0.",
    "pot_change_time": "Change pots when the plant becomes root-bound, typically every 6 months.",
    "helpful": "Rich in iron, calcium, and vitamins A and K, helps with bone health and energy.",
    "appearance": "Dark green, tender leaves that grow in a rosette pattern.",
    "temperature_range": "Prefers cooler temperatures between 50-60°F (10-16°C).",
    "humidity_needs": "Moderate humidity, keep soil evenly moist.",
    "planting_season": "Best planted in early spring or fall, as spinach thrives in cooler weather.",
    "growth_rate": "Fast-growing, ready for harvest in 30-45 days.",
    "fertilizer": "Use a balanced fertilizer every 3-4 weeks during the growing season."
  },
  {
    "id": 13,
    "common_name": "Pea",
    "scientific_name": "Pisum sativum",
    "how_to_handle": "Handle gently when transplanting, as peas have delicate roots. Provide support for climbing varieties.",
    "light_needs": "Full sun, at least 6 hours of direct sunlight per day.",
    "watering": "Water regularly, keeping the soil moist but not soggy. Avoid overhead watering.",
    "soil_type": "Well-drained, fertile soil with a pH of 6.0 to 7.0.",
    "pot_change_time": "Change pots when plants outgrow their current container, typically every 6 months.",
    "helpful": "High in fiber and protein, helps support digestive health.",
    "appearance": "Vining or bushy plant with small white or purple flowers and green pods.",
    "temperature_range": "Prefers cooler temperatures between 55-75°F (13-24°C).",
    "humidity_needs": "Moderate humidity, avoid overly wet conditions.",
    "planting_season": "Best planted in early spring, before the last frost.",
    "growth_rate": "Fast-growing, ready for harvest in 60-70 days.",
    "fertilizer": "Use a balanced fertilizer once a month during the growing season."
  },
  {
    "id": 14,
    "common_name": "Aloe Vera",
    "scientific_name": "Aloe barbadensis miller",
    "how_to_handle": "Handle carefully, as aloe vera has thick, fleshy leaves. Avoid over-watering and let the soil dry out between watering.",
    "light_needs": "Full sun, at least 6 hours of direct sunlight per day.",
    "watering": "Water sparingly, allowing the soil to dry out completely between waterings.",
    "soil_type": "Well-drained, sandy or loamy soil with a slightly acidic to neutral pH (6.0 to 7.0).",
    "pot_change_time": "Change pots when the plant becomes root-bound, typically every 1-2 years.",
    "helpful": "Known for its medicinal properties, particularly for soothing burns and skin irritations.",
    "appearance": "A succulent with thick, fleshy leaves that are green to gray-green in color.",
    "temperature_range": "Prefers warm temperatures between 60-85°F (16-29°C).",
    "humidity_needs": "Low humidity, aloe vera thrives in dry conditions.",
    "planting_season": "Can be planted year-round, but spring and summer are best for growth.",
    "growth_rate": "Slow-growing, but can live for many years with proper care.",
    "fertilizer": "Use a balanced fertilizer once or twice during the growing season."
  },
  {
    "id": 15,
    "common_name": "Cilantro",
    "scientific_name": "Coriandrum sativum",
    "how_to_handle": "Handle with care when transplanting, as cilantro has a taproot that can be easily disturbed. Thin plants to ensure good airflow.",
    "light_needs": "Full sun, but tolerates partial shade, especially in hot climates.",
    "watering": "Water regularly to keep the soil moist, but avoid waterlogging.",
    "soil_type": "Well-drained, fertile soil with a slightly acidic to neutral pH (6.0 to 7.0).",
    "pot_change_time": "Change pots when plants become root-bound, typically every 6-12 months.",
    "helpful": "Used in cooking for its fresh, aromatic flavor; also has medicinal uses.",
    "appearance": "Feathery, delicate green leaves and small white flowers.",
    "temperature_range": "Prefers cool to warm temperatures between 55-75°F (13-24°C).",
    "humidity_needs": "Moderate humidity, avoid excessive moisture on the foliage.",
    "planting_season": "Best planted in early spring or fall.",
    "growth_rate": "Fast-growing, can be harvested in 30-60 days depending on variety.",
    "fertilizer": "Use a light, balanced fertilizer once a month during the growing season."
  }
]
